jmeter.log
2020-12-10 19:51:31,250 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2020-12-10 19:51:31,283 INFO o.a.j.JMeter: Loading user properties from: C:\apache-jmeter-5.3\bin\user.properties
2020-12-10 19:51:31,285 INFO o.a.j.JMeter: Loading system properties from: C:\apache-jmeter-5.3\bin\system.properties
2020-12-10 19:51:31,287 INFO o.a.j.JMeter: Copyright (c) 1998-2020 The Apache Software Foundation
2020-12-10 19:51:31,288 INFO o.a.j.JMeter: Version 5.3
2020-12-10 19:51:31,288 INFO o.a.j.JMeter: java.version=1.8.0_201
2020-12-10 19:51:31,288 INFO o.a.j.JMeter: java.vm.name=Java HotSpot(TM) 64-Bit Server VM
2020-12-10 19:51:31,288 INFO o.a.j.JMeter: os.name=Windows 10
2020-12-10 19:51:31,288 INFO o.a.j.JMeter: os.arch=amd64
2020-12-10 19:51:31,288 INFO o.a.j.JMeter: os.version=10.0
2020-12-10 19:51:31,288 INFO o.a.j.JMeter: file.encoding=GBK
2020-12-10 19:51:31,289 INFO o.a.j.JMeter: java.awt.headless=true
2020-12-10 19:51:31,289 INFO o.a.j.JMeter: Max memory     =1073741824
2020-12-10 19:51:31,289 INFO o.a.j.JMeter: Available Processors =8
2020-12-10 19:51:31,299 INFO o.a.j.JMeter: Default Locale=English (EN)
2020-12-10 19:51:31,299 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2020-12-10 19:51:31,299 INFO o.a.j.JMeter: JMeterHome=C:\apache-jmeter-5.3
2020-12-10 19:51:31,300 INFO o.a.j.JMeter: user.dir  =C:\jmeter_test_plan
2020-12-10 19:51:31,300 INFO o.a.j.JMeter: PWD       =C:\jmeter_test_plan
2020-12-10 19:51:31,305 INFO o.a.j.JMeter: IP: 192.168.13.67 Name: LAPTOP-3BSH24T4 FullName: LAPTOP-3BSH24T4
2020-12-10 19:51:31,313 INFO o.a.j.JMeter: Setting property 'jmeter.reportgenerator.outputdir' to:'C:\jmeter_test_plan\report\2020-12-10-19-51-28秒'
2020-12-10 19:51:31,319 INFO o.a.j.s.FileServer: Default base='C:\jmeter_test_plan'
2020-12-10 19:51:31,327 INFO o.a.j.s.FileServer: Set new base='C:\jmeter_test_plan'
2020-12-10 19:51:31,622 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2020-12-10 19:51:31,690 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2020-12-10 19:51:31,702 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2020-12-10 19:51:31,715 INFO o.a.j.s.SaveService: Loading file: C:\jmeter_test_plan\工作面移交-新.jmx
2020-12-10 19:51:31,815 INFO o.a.j.p.h.c.CookieManager: Settings: Delete null: true Check: true Allow variable: true Save: false Prefix: COOKIE_
2020-12-10 19:51:31,861 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2020-12-10 19:51:31,862 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2020-12-10 19:51:31,862 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2020-12-10 19:51:31,863 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2020-12-10 19:51:31,863 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2020-12-10 19:51:31,864 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2020-12-10 19:51:32,018 INFO o.a.j.JMeter: Creating summariser <summary>
2020-12-10 19:51:32,028 INFO o.a.j.r.d.ReportGenerator: ReportGenerator will use for Parsing the separator: ','
2020-12-10 19:51:32,029 INFO o.a.j.r.d.ReportGenerator: Will generate report at end of test from  results file: C:\jmeter_test_plan\test_result\2020-12-10-19-51-28秒\result.jtl
2020-12-10 19:51:32,029 INFO o.a.j.r.d.ReportGenerator: Reading report generator properties from: C:\apache-jmeter-5.3\bin\reportgenerator.properties
2020-12-10 19:51:32,030 INFO o.a.j.r.d.ReportGenerator: Merging with JMeter properties
2020-12-10 19:51:32,044 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.temp_dir' not found, using default value 'temp' instead.
2020-12-10 19:51:32,051 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.apdex_per_transaction' not found, using default value 'null' instead.
2020-12-10 19:51:32,052 INFO o.a.j.r.c.ReportGeneratorConfiguration: apdex_per_transaction is empty, not APDEX per transaction customization
2020-12-10 19:51:32,052 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.sample_filter' not found, using default value 'null' instead.
2020-12-10 19:51:32,052 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.report_title' not found, using default value 'null' instead.
2020-12-10 19:51:32,052 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.start_date' not found, using default value 'null' instead.
2020-12-10 19:51:32,053 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.end_date' not found, using default value 'null' instead.
2020-12-10 19:51:32,053 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.date_format' not found, using default value 'null' instead.
2020-12-10 19:51:32,054 INFO o.a.j.r.c.ReportGeneratorConfiguration: Will use date range start date: null, end date: null
2020-12-10 19:51:32,063 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.totalTPS.exclude_controllers' not found, using default value 'false' instead.
2020-12-10 19:51:32,063 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.activeThreadsOverTime.exclude_controllers' not found, using default value 'false' instead.
2020-12-10 19:51:32,064 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.timeVsThreads.exclude_controllers' not found, using default value 'false' instead.
2020-12-10 19:51:32,064 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimeDistribution.exclude_controllers' not found, using default value 'false' instead.
2020-12-10 19:51:32,064 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.transactionsPerSecond.exclude_controllers' not found, using default value 'false' instead.
2020-12-10 19:51:32,065 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimePercentiles.exclude_controllers' not found, using default value 'false' instead.
2020-12-10 19:51:32,065 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimePercentilesOverTime.exclude_controllers' not found, using default value 'false' instead.
2020-12-10 19:51:32,066 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimesOverTime.exclude_controllers' not found, using default value 'false' instead.
2020-12-10 19:51:32,066 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.connectTimeOverTime.exclude_controllers' not found, using default value 'false' instead.
2020-12-10 19:51:32,066 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.latenciesOverTime.exclude_controllers' not found, using default value 'false' instead.
2020-12-10 19:51:32,069 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.filters_only_sample_series' not found, using default value 'true' instead.
2020-12-10 19:51:32,069 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.series_filter' not found, using default value '' instead.
2020-12-10 19:51:32,079 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.show_controllers_only' not found, using default value 'false' instead.
2020-12-10 19:51:32,080 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.filters_only_sample_series' not found, using default value 'true' instead.
2020-12-10 19:51:32,081 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.series_filter' not found, using default value '' instead.
2020-12-10 19:51:32,081 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.show_controllers_only' not found, using default value 'false' instead.
2020-12-10 19:51:32,111 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2020-12-10 19:51:32,113 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2020-12-10 19:51:32,113 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2020-12-10 19:51:32,126 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2020-12-10 19:51:32,126 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2020-12-10 19:51:33,036 INFO o.a.j.r.ResultCollector: Folder at C:\jmeter_test_plan\test_result\2020-12-10-19-51-28秒 was created
2020-12-10 19:51:33,061 INFO o.a.j.JMeter: Running test (1607601093061)
2020-12-10 19:51:33,132 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : 工作面移交
2020-12-10 19:51:33,133 INFO o.a.j.e.StandardJMeterEngine: Starting 1 threads for group 工作面移交.
2020-12-10 19:51:33,133 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2020-12-10 19:51:33,134 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=1 ramp-up=1 delayedStart=false
2020-12-10 19:51:33,145 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2020-12-10 19:51:33,145 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2020-12-10 19:51:33,152 INFO o.a.j.t.JMeterThread: Thread started: 工作面移交 1-1
2020-12-10 19:51:33,198 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = LAPTOP-3BSH24T4
2020-12-10 19:51:33,211 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2020-12-10 19:51:33,214 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2020-12-10 19:51:33,215 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to ISO-8859-1
2020-12-10 19:51:33,215 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2020-12-10 19:51:33,215 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2020-12-10 19:51:33,515 INFO o.a.j.r.Summariser: summary +      1 in 00:00:00 =    2.2/s Avg:   171 Min:   171 Max:   171 Err:     0 (0.00%) Active: 1 Started: 1 Finished: 0
2020-12-10 19:51:34,691 INFO o.a.j.s.FileServer: Stored: C:\workspace\my_png\IMG_1.png
2020-12-10 19:51:36,573 INFO o.a.j.t.JMeterThread: Thread is done: 工作面移交 1-1
2020-12-10 19:51:36,574 INFO o.a.j.t.JMeterThread: Thread finished: 工作面移交 1-1
2020-12-10 19:51:36,576 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2020-12-10 19:51:36,578 INFO o.a.j.r.Summariser: summary +      6 in 00:00:03 =    2.0/s Avg:   482 Min:     2 Max:  1481 Err:     0 (0.00%) Active: 0 Started: 1 Finished: 1
2020-12-10 19:51:36,579 INFO o.a.j.r.Summariser: summary =      7 in 00:00:04 =    2.0/s Avg:   437 Min:     2 Max:  1481 Err:     0 (0.00%)
2020-12-10 19:51:36,579 INFO o.a.j.JMeter: Generating Dashboard
2020-12-10 19:51:36,579 INFO o.a.j.r.d.ReportGenerator: Flushing result collector before report Generation
2020-12-10 19:51:36,608 INFO o.a.j.r.p.NormalizerSampleConsumer: Using format, 'ms', to parse timeStamp field
2020-12-10 19:51:38,223 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.AggregateConsumer#stopProducing(): beginDate produced 0 samples
2020-12-10 19:51:38,223 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.AggregateConsumer#stopProducing(): endDate produced 0 samples
2020-12-10 19:51:38,227 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.ApdexSummaryConsumer#stopProducing(): apdexSummary produced 0 samples
2020-12-10 19:51:38,227 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.RequestsSummaryConsumer#stopProducing(): requestsSummary produced 0 samples
2020-12-10 19:51:38,253 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.StatisticsSummaryConsumer#stopProducing(): statisticsSummary produced 0 samples
2020-12-10 19:51:38,262 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.Top5ErrorsBySamplerConsumer#stopProducing(): top5ErrorsBySampler produced 0 samples
2020-12-10 19:51:38,262 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.ErrorsSummaryConsumer#stopProducing(): errorsSummary produced 0 samples
2020-12-10 19:51:38,263 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.HitsPerSecondGraphConsumer#stopProducing(): hitsPerSecond produced 0 samples
2020-12-10 19:51:38,287 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.LatencyVSRequestGraphConsumer#stopProducing(): latencyVsRequest produced 0 samples
2020-12-10 19:51:38,287 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.SyntheticResponseTimeDistributionGraphConsumer#stopProducing(): syntheticResponseTimeDistribution produced 0 samples
2020-12-10 19:51:38,288 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.BytesThroughputGraphConsumer#stopProducing(): bytesThroughputOverTime produced 0 samples
2020-12-10 19:51:38,288 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.CodesPerSecondGraphConsumer#stopProducing(): codesPerSecond produced 0 samples
2020-12-10 19:51:38,300 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeVSRequestGraphConsumer#stopProducing(): responseTimeVsRequest produced 0 samples
2020-12-10 19:51:38,300 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): startIntervalControlerFilter produced 49 samples
2020-12-10 19:51:38,300 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TotalTPSGraphConsumer#stopProducing(): totalTPS produced 0 samples
2020-12-10 19:51:38,301 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ActiveThreadsGraphConsumer#stopProducing(): activeThreadsOverTime produced 0 samples
2020-12-10 19:51:38,301 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TimeVSThreadGraphConsumer#stopProducing(): timeVsThreads produced 0 samples
2020-12-10 19:51:38,302 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeDistributionGraphConsumer#stopProducing(): responseTimeDistribution produced 0 samples
2020-12-10 19:51:38,302 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TransactionsPerSecondGraphConsumer#stopProducing(): transactionsPerSecond produced 0 samples
2020-12-10 19:51:38,302 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimePercentilesGraphConsumer#stopProducing(): responseTimePercentiles produced 0 samples
2020-12-10 19:51:38,306 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimePercentilesOverTimeGraphConsumer#stopProducing(): responseTimePercentilesOverTime produced 0 samples
2020-12-10 19:51:38,306 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeOverTimeGraphConsumer#stopProducing(): responseTimesOverTime produced 0 samples
2020-12-10 19:51:38,307 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ConnectTimeOverTimeGraphConsumer#stopProducing(): connectTimeOverTime produced 0 samples
2020-12-10 19:51:38,307 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.LatencyOverTimeGraphConsumer#stopProducing(): latenciesOverTime produced 0 samples
2020-12-10 19:51:38,307 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): nameFilter produced 105 samples
2020-12-10 19:51:38,307 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): dateRangeFilter produced 21 samples
2020-12-10 19:51:38,307 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.NormalizerSampleConsumer#stopProducing(): normalizer produced 7 samples
2020-12-10 19:51:38,308 INFO o.a.j.r.p.CsvFileSampleSource: produce(): 7 samples produced in 1s 647 ms on channel 0
2020-12-10 19:51:38,308 INFO o.a.j.r.d.ReportGenerator: Exporting data using exporter:'json' of className:'org.apache.jmeter.report.dashboard.JsonExporter'
2020-12-10 19:51:38,315 INFO o.a.j.r.d.JsonExporter: Found data for consumer statisticsSummary?in context
2020-12-10 19:51:38,315 INFO o.a.j.r.d.JsonExporter: Creating statistics for overall
2020-12-10 19:51:38,316 INFO o.a.j.r.d.JsonExporter: Creating statistics for other transactions
2020-12-10 19:51:38,317 INFO o.a.j.r.d.JsonExporter: Checking output folder
2020-12-10 19:51:38,320 INFO o.a.j.r.d.JsonExporter: Writing statistics JSON to C:\jmeter_test_plan\report\2020-12-10-19-51-28秒\statistics.json
2020-12-10 19:51:38,687 INFO o.a.j.r.d.ReportGenerator: Exporting data using exporter:'html' of className:'org.apache.jmeter.report.dashboard.HtmlTemplateExporter'
2020-12-10 19:51:38,696 INFO o.a.j.r.d.HtmlTemplateExporter: Will generate dashboard in folder: C:\jmeter_test_plan\report\2020-12-10-19-51-28秒
2020-12-10 19:51:39,249 ERROR f.configuration: DefaultObjectWrapper.incompatibleImprovements was set to the object returned by Configuration.getVersion(). That defeats the purpose of incompatibleImprovements, and makes upgrading FreeMarker a potentially breaking change. Also, this probably won't be allowed starting from 2.4.0. Instead, set incompatibleImprovements to the highest concrete version that's known to be compatible with your application.
2020-12-10 19:51:39,253 ERROR f.configuration: Configuration.incompatibleImprovements was set to the object returned by Configuration.getVersion(). That defeats the purpose of incompatibleImprovements, and makes upgrading FreeMarker a potentially breaking change. Also, this probably won't be allowed starting from 2.4.0. Instead, set incompatibleImprovements to the highest concrete version that's known to be compatible with your application.
2020-12-10 19:51:39,277 INFO o.a.j.r.d.HtmlTemplateExporter: Report will be generated in: C:\jmeter_test_plan\report\2020-12-10-19-51-28秒, creating folder structure
2020-12-10 19:51:39,284 INFO o.a.j.r.d.TemplateVisitor: Copying folder from 'C:\apache-jmeter-5.3\bin\report-template' to 'C:\jmeter_test_plan\report\2020-12-10-19-51-28秒', got message: C:\jmeter_test_plan\report\2020-12-10-19-51-28秒, found non empty folder with following content [C:\jmeter_test_plan\report\2020-12-10-19-51-28秒\statistics.json], will be ignored
2020-12-10 19:51:40,307 INFO o.a.j.JMeter: Dashboard generated