report/2020-12-24-10-00-01秒/statistics.json
{
  "甲方项目经理审核表单不通过" : {
    "transaction" : "甲方项目经理审核表单不通过",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 360.0,
    "medianResTime" : 360.0,
    "minResTime" : 360.0,
    "maxResTime" : 360.0,
    "pct1ResTime" : 360.0,
    "pct2ResTime" : 360.0,
    "pct3ResTime" : 360.0,
    "throughput" : 2.7777777777777777,
    "receivedKBytesPerSec" : 1.2803819444444444,
    "sentKBytesPerSec" : 2.8510199652777777
  },
  "接收人登录" : {
    "transaction" : "接收人登录",
    "sampleCount" : 2,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 38.5,
    "medianResTime" : 38.5,
    "minResTime" : 37.0,
    "maxResTime" : 40.0,
    "pct1ResTime" : 40.0,
    "pct2ResTime" : 40.0,
    "pct3ResTime" : 40.0,
    "throughput" : 0.4844961240310077,
    "receivedKBytesPerSec" : 0.320789425872093,
    "sentKBytesPerSec" : 0.19895568374515504
  },
  "移交人登录" : {
    "transaction" : "移交人登录",
    "sampleCount" : 2,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 37.5,
    "medianResTime" : 37.5,
    "minResTime" : 37.0,
    "maxResTime" : 38.0,
    "pct1ResTime" : 38.0,
    "pct2ResTime" : 38.0,
    "pct3ResTime" : 38.0,
    "throughput" : 0.4610419548178884,
    "receivedKBytesPerSec" : 0.3052602005532503,
    "sentKBytesPerSec" : 0.18932435742277548
  },
  "调试取样器" : {
    "transaction" : "调试取样器",
    "sampleCount" : 2,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.0,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 2.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 2.0,
    "throughput" : 0.5102040816326531,
    "receivedKBytesPerSec" : 0.5610251913265306,
    "sentKBytesPerSec" : 0.0
  },
  "发起人登录" : {
    "transaction" : "发起人登录",
    "sampleCount" : 2,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 162.5,
    "medianResTime" : 162.5,
    "minResTime" : 39.0,
    "maxResTime" : 286.0,
    "pct1ResTime" : 286.0,
    "pct2ResTime" : 286.0,
    "pct3ResTime" : 286.0,
    "throughput" : 0.37929072634174094,
    "receivedKBytesPerSec" : 0.2533543523610848,
    "sentKBytesPerSec" : 0.15686486582590556
  },
  "总监审核通过表单" : {
    "transaction" : "总监审核通过表单",
    "sampleCount" : 2,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 305.5,
    "medianResTime" : 305.5,
    "minResTime" : 295.0,
    "maxResTime" : 316.0,
    "pct1ResTime" : 316.0,
    "pct2ResTime" : 316.0,
    "pct3ResTime" : 316.0,
    "throughput" : 0.46794571829667764,
    "receivedKBytesPerSec" : 0.2156937295273748,
    "sentKBytesPerSec" : 0.4323014155357979
  },
  "验证表单生成" : {
    "transaction" : "验证表单生成",
    "sampleCount" : 2,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 484.0,
    "medianResTime" : 484.0,
    "minResTime" : 332.0,
    "maxResTime" : 636.0,
    "pct1ResTime" : 636.0,
    "pct2ResTime" : 636.0,
    "pct3ResTime" : 636.0,
    "throughput" : 0.4048582995951417,
    "receivedKBytesPerSec" : 2.2514312373481777,
    "sentKBytesPerSec" : 0.22852353238866394
  },
  "获取表单接收内容" : {
    "transaction" : "获取表单接收内容",
    "sampleCount" : 2,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 246.5,
    "medianResTime" : 246.5,
    "minResTime" : 226.0,
    "maxResTime" : 267.0,
    "pct1ResTime" : 267.0,
    "pct2ResTime" : 267.0,
    "pct3ResTime" : 267.0,
    "throughput" : 0.46328468844104703,
    "receivedKBytesPerSec" : 0.40627895529302754,
    "sentKBytesPerSec" : 0.25064425526986334
  },
  "甲方登录" : {
    "transaction" : "甲方登录",
    "sampleCount" : 2,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 36.0,
    "medianResTime" : 36.0,
    "minResTime" : 32.0,
    "maxResTime" : 40.0,
    "pct1ResTime" : 40.0,
    "pct2ResTime" : 40.0,
    "pct3ResTime" : 40.0,
    "throughput" : 0.501378791677112,
    "receivedKBytesPerSec" : 0.33196759839558787,
    "sentKBytesPerSec" : 0.2058884588869391
  },
  "甲方项目经理审核通过表单" : {
    "transaction" : "甲方项目经理审核通过表单",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 318.0,
    "medianResTime" : 318.0,
    "minResTime" : 318.0,
    "maxResTime" : 318.0,
    "pct1ResTime" : 318.0,
    "pct2ResTime" : 318.0,
    "pct3ResTime" : 318.0,
    "throughput" : 3.1446540880503147,
    "receivedKBytesPerSec" : 1.4494889937106918,
    "sentKBytesPerSec" : 3.2275697720125787
  },
  "填写工作面移交表单" : {
    "transaction" : "填写工作面移交表单",
    "sampleCount" : 2,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 455.0,
    "medianResTime" : 455.0,
    "minResTime" : 404.0,
    "maxResTime" : 506.0,
    "pct1ResTime" : 506.0,
    "pct2ResTime" : 506.0,
    "pct3ResTime" : 506.0,
    "throughput" : 0.39896269698783166,
    "receivedKBytesPerSec" : 0.18389686814282866,
    "sentKBytesPerSec" : 0.399741921005386
  },
  "确认接收表单" : {
    "transaction" : "确认接收表单",
    "sampleCount" : 2,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 278.5,
    "medianResTime" : 278.5,
    "minResTime" : 266.0,
    "maxResTime" : 291.0,
    "pct1ResTime" : 291.0,
    "pct2ResTime" : 291.0,
    "pct3ResTime" : 291.0,
    "throughput" : 0.4633920296570899,
    "receivedKBytesPerSec" : 0.21359476367006489,
    "sentKBytesPerSec" : 0.4149711828081557
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 38,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 230.8947368421053,
    "medianResTime" : 266.5,
    "minResTime" : 0.0,
    "maxResTime" : 636.0,
    "pct1ResTime" : 460.70000000000005,
    "pct2ResTime" : 512.4999999999997,
    "pct3ResTime" : 636.0,
    "throughput" : 4.1530054644808745,
    "receivedKBytesPerSec" : 5.056672643442623,
    "sentKBytesPerSec" : 4.239668715846994
  },
  "获取表单定义" : {
    "transaction" : "获取表单定义",
    "sampleCount" : 2,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 254.5,
    "medianResTime" : 254.5,
    "minResTime" : 235.0,
    "maxResTime" : 274.0,
    "pct1ResTime" : 274.0,
    "pct2ResTime" : 274.0,
    "pct3ResTime" : 274.0,
    "throughput" : 0.3840983291722681,
    "receivedKBytesPerSec" : 1.2445686095640485,
    "sentKBytesPerSec" : 0.2100537737660841
  },
  "确认移交表单" : {
    "transaction" : "确认移交表单",
    "sampleCount" : 2,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 421.5,
    "medianResTime" : 421.5,
    "minResTime" : 358.0,
    "maxResTime" : 485.0,
    "pct1ResTime" : 485.0,
    "pct2ResTime" : 485.0,
    "pct3ResTime" : 485.0,
    "throughput" : 0.4372540445999126,
    "receivedKBytesPerSec" : 0.2015467861827722,
    "sentKBytesPerSec" : 0.33434562199387846
  },
  "总监登录" : {
    "transaction" : "总监登录",
    "sampleCount" : 2,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 58.5,
    "medianResTime" : 58.5,
    "minResTime" : 37.0,
    "maxResTime" : 80.0,
    "pct1ResTime" : 80.0,
    "pct2ResTime" : 80.0,
    "pct3ResTime" : 80.0,
    "throughput" : 0.4924895345973898,
    "receivedKBytesPerSec" : 0.3260819379463186,
    "sentKBytesPerSec" : 0.2022381340802758
  },
  "上传附件" : {
    "transaction" : "上传附件",
    "sampleCount" : 2,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 73.5,
    "medianResTime" : 73.5,
    "minResTime" : 38.0,
    "maxResTime" : 109.0,
    "pct1ResTime" : 109.0,
    "pct2ResTime" : 109.0,
    "pct3ResTime" : 109.0,
    "throughput" : 0.43299415457891316,
    "receivedKBytesPerSec" : 0.22791391534964278,
    "sentKBytesPerSec" : 3.872633754600563
  },
  "获取表单审核内容" : {
    "transaction" : "获取表单审核内容",
    "sampleCount" : 4,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 264.0,
    "medianResTime" : 264.0,
    "minResTime" : 256.0,
    "maxResTime" : 272.0,
    "pct1ResTime" : 272.0,
    "pct2ResTime" : 272.0,
    "pct3ResTime" : 272.0,
    "throughput" : 0.8262755629002272,
    "receivedKBytesPerSec" : 0.6640867072918818,
    "sentKBytesPerSec" : 0.44702799008469324
  },
  "获取发起表单定义" : {
    "transaction" : "获取发起表单定义",
    "sampleCount" : 2,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 380.0,
    "medianResTime" : 380.0,
    "minResTime" : 302.0,
    "maxResTime" : 458.0,
    "pct1ResTime" : 458.0,
    "pct2ResTime" : 458.0,
    "pct3ResTime" : 458.0,
    "throughput" : 0.3968253968253968,
    "receivedKBytesPerSec" : 1.5299479166666667,
    "sentKBytesPerSec" : 0.20190042162698413
  },
  "获取表单移交内容" : {
    "transaction" : "获取表单移交内容",
    "sampleCount" : 2,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 287.0,
    "medianResTime" : 287.0,
    "minResTime" : 245.0,
    "maxResTime" : 329.0,
    "pct1ResTime" : 329.0,
    "pct2ResTime" : 329.0,
    "pct3ResTime" : 329.0,
    "throughput" : 0.4398504508467121,
    "receivedKBytesPerSec" : 0.32816967231141414,
    "sentKBytesPerSec" : 0.23796596657136576
  }
}